<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-forms-dev","backend":"9092a4ba553d915b1a86f76657850e2d21500ee870186feed9d5a1be5cccd8c8","plan_job_ref":"Job Post Terraform plan to PR comment #611 at https://github.com/GSA-TTS/forms/actions/runs/12777820320","plan_out_hash":"c2c676e9f70fb76ad1b10b353df07562c1ccc3cdef77420bbdf7bd0a831a7dc0","plan_hash":"36ef1bcccf4ac33be942ef93e4226ecb78f69afc0a218ac94bbb85aed346812b","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan for __tts-10x-forms-dev__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-forms-dev-server-doj_tts-10x-forms-dev-server-doj-app_22D74DC4 will be created
+   resource "cloudfoundry_app" "tts-10x-forms-dev-server-doj_tts-10x-forms-dev-server-doj-app_22D74DC4" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/server-doj:7a7fa917d549e995a8d632174b248295b97d5a5e"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-dev-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 300

+       routes {
+           port  = (known after apply)
+           route = "a5a2085e-dbf6-43a2-ad92-7ac4a06d1fc0"
        }

+       service_binding {
+           service_instance = "4c335cfb-7eb1-48a4-bc13-f30cb351f3cf"
        }
+       service_binding {
+           service_instance = "5b76582e-ab6e-45fc-abcc-1bbee840a5e1"
        }
    }

  # cloudfoundry_app.tts-10x-forms-dev-server-kansas_tts-10x-forms-dev-server-kansas-app_6E2DB37A will be created
+   resource "cloudfoundry_app" "tts-10x-forms-dev-server-kansas_tts-10x-forms-dev-server-kansas-app_6E2DB37A" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/server-kansas:7a7fa917d549e995a8d632174b248295b97d5a5e"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-dev-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 300

+       routes {
+           port  = (known after apply)
+           route = "31e71ca1-7f0a-4314-97aa-292d2614bebd"
        }

+       service_binding {
+           service_instance = "94d26df1-7d46-4d14-b861-39259ac2d345"
        }
+       service_binding {
+           service_instance = "dbcb7300-afb1-4ffc-af5e-d3caa8991c45"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #611](https://github.com/GSA-TTS/forms/actions/runs/12777820320)